---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.AllElementsRemovedFromCircuitGroup
source: html/cfa8498d-6e73-6190-273f-fcf2702c04c9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.AllElementsRemovedFromCircuitGroup Property

[System] is empty and will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId AllElementsRemovedFromCircuitGroup { get; }
```